---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MaxColor
source: html/cbc675e0-7085-5d7d-9244-1d375bdafe6d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MaxColor Property

Color assigned to the maximum value.

## Syntax (C#)
```csharp
public Color MaxColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null